Organization.org
* Thinkpad Inspired Motherboard
** Current Challenges Checklist
  Note that the order in which these itens are displayed does not explict dependencies, for that there will be a sub list for every item in the list containing its dependencies(if any).
  * Finding a processor socket package for either kicad open source PCB CAD or Altium PCB CAD.
  * Choosing the bios chip for the board.
  * Choosing between using on board GPU or external one.
  * Choosing between DDR3/4 RAM or both.
  * Choosing how many RAM slot there will be in the main board
  * Choosing between USB 2.0 or USB 3.0 or USB 3.1
  * Chossing how many USB slots there will be in the main board
  * TODO...
* TODO hardware part I [0/2]
- [-] Documentation [0/2]
  - [ ] Defining Specifications
  - [ ] Generating Documentation
- [-] Research[0/3]
  - [-] Reverser Engineering [0/2]
    - [ ] Choosing boards for RE
    - [ ] RE boards and compiling theirs engineering technics
  - [-] PCB designing [0/3]
    - [ ] 
    - [ ]
    - [ ]
  - [-] PCB manufacturing [0/4]
    - [ ] PCB cost per unit
    - [ ] PCB components cost per unit
    - [ ] PCB assembly cost
    - [ ] Generating documentation and adding it to master
- [ ] TODO TODO
* TODO software part I [0/n]
- [-] Documentation [0/2]
  - [ ] Defining Specifications
  - [ ] Generating Documentation
- [-] Custom bios [0/n]
- [-] Leds programming [0/n]
- [-] Custom bootloader [0/n]
- [-] Custom kernel [0/n]
- [-] Intranet [0/n]
  - [-] Encryption [0/n]
  - [-] Decryption [0/n]
- [-] Custom Drivers [0/n]