Organization.tex
% Created 2018-08-20 Mon 20:22
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\author{Arquimedes Vinicius Pereira de Franca Moura}
\date{\today}
\title{ThinkPad Inspired Motherboard}
\hypersetup{
 pdfauthor={Arquimedes Vinicius Pereira de Franca Moura},
 pdftitle={ThinkPad Inspired Motherboard},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 26.1 (Org mode 9.1.9)}, 
 pdflang={English}}
\begin{document}

\maketitle
\tableofcontents

\section{Current Challenges Checklist\hfill{}\textsc{lo}}
\label{sec:orgf8b7fd9}
Note that the order in which these itens are displayed does not explict dependencies, for that there will be a sub list for every item in the list containing its dependencies(if any).
\subsection{Finding a processor socket package for either kicad open source PCB CAD or Altium PCB CAD.}
\label{sec:org345a9a4}
\subsection{Choosing the bios chip for the board.}
\label{sec:orgb1fc3a6}
\subsection{Choosing between using on board GPU or external one.}
\label{sec:org61e8bb1}
\subsection{Choosing between DDR3/4 RAM or both.}
\label{sec:org868cffe}
\subsection{Choosing how many RAM slot there will be in the main board}
\label{sec:org96ffd18}
\subsection{Choosing between USB 2.0 or USB 3.0 or USB 3.1}
\label{sec:org17a3779}
\subsection{Chossing how many USB slots there will be in the main board}
\label{sec:orgbddeff2}
\subsection{{\bfseries\sffamily TODO} \ldots{}}
\label{sec:orga5e5c32}

\section{{\bfseries\sffamily TODO} Hardware part I [0/3]}
\label{sec:orgc3f9416}
\begin{itemize}
\item[{$\square$}] Documentation [0/2]
\begin{itemize}
\item[{$\square$}] Defining Specifications
\item[{$\square$}] Generating Documentation
\end{itemize}
\item[{$\square$}] Research[0/3]
\begin{itemize}
\item[{$\square$}] Reverser Engineering [0/2]
\begin{itemize}
\item[{$\square$}] Choosing boards for RE
\item[{$\square$}] RE boards and compiling theirs engineering technics
\end{itemize}
\item[{$\square$}] PCB designing [0/3]
\begin{itemize}
\item[{$\square$}] 

\item[{$\square$}] 

\item[{$\square$}] 
\end{itemize}
\item[{$\square$}] PCB manufacturing [0/4]
\begin{itemize}
\item[{$\square$}] PCB cost per unit
\item[{$\square$}] PCB components cost per unit
\item[{$\square$}] PCB assembly cost
\item[{$\square$}] Generating documentation and adding it to master
\end{itemize}
\end{itemize}
\item[{$\square$}] TODO TODO
\end{itemize}
\section{{\bfseries\sffamily TODO} Software part I [0/n]}
\label{sec:org9788499}
\begin{itemize}
\item[{$\boxminus$}] Documentation [0/2]
\begin{itemize}
\item[{$\square$}] Defining Specifications
\item[{$\square$}] Generating Documentation
\end{itemize}
\item[{$\boxminus$}] Custom bios [0/n]
\item[{$\boxminus$}] Leds programming [0/n]
\item[{$\boxminus$}] Custom bootloader [0/n]
\item[{$\boxminus$}] Custom kernel [0/n]
\item[{$\square$}] Intranet [0/2]
\begin{itemize}
\item[{$\square$}] Encryption [0/n]
\item[{$\square$}] Decryption [0/n]
\end{itemize}
\item[{$\boxminus$}] Custom Drivers [0/n]
\end{itemize}
\end{document}
